{"class_name": "Sequential", "keras_version": "2.0.8", "backend": "tensorflow", "config": [{"class_name": "Embedding", "config": {"output_dim": 50, "trainable": false, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "activity_regularizer": null, "input_dim": 13369, "name": "embedding_4", "dtype": "float32", "embeddings_regularizer": null, "mask_zero": false, "batch_input_shape": [64, 15], "input_length": 15, "embeddings_constraint": null}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "recurrent_regularizer": null, "implementation": 0, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "name": "lstm_8", "units": 512, "recurrent_dropout": 0.0, "unit_forget_bias": true, "stateful": true, "return_state": false, "use_bias": true, "return_sequences": true, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "dropout": 0.0, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "recurrent_regularizer": null, "implementation": 0, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "name": "lstm_9", "units": 512, "recurrent_dropout": 0.0, "unit_forget_bias": true, "stateful": true, "return_state": false, "use_bias": true, "return_sequences": true, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "dropout": 0.0, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "recurrent_regularizer": null, "implementation": 0, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "name": "lstm_10", "units": 512, "recurrent_dropout": 0.0, "unit_forget_bias": true, "stateful": true, "return_state": false, "use_bias": true, "return_sequences": true, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "dropout": 0.0, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activation": "tanh"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "units": 13369, "name": "dense_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, "name": "time_distributed_4"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "softmax"}}]}